program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios17>(tensor<fp32, [1, 3, 112, 112]> input) {
            tensor<fp32, []> input__scaled___y_0 = const()[name = tensor<string, []>("input__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-7)];
            tensor<fp32, [1, 3, 112, 112]> input__scaled__ = mul(x = input, y = input__scaled___y_0)[name = tensor<string, []>("input__scaled__")];
            tensor<fp32, [1, 3, 1, 1]> input__biased___y_0 = const()[name = tensor<string, []>("input__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1p+0]], [[-0x1p+0]], [[-0x1p+0]]]])];
            tensor<fp32, [1, 3, 112, 112]> input__biased__ = add(x = input__scaled__, y = input__biased___y_0)[name = tensor<string, []>("input__biased__")];
            tensor<string, []> input_tensor_1_pad_type_0 = const()[name = tensor<string, []>("input_tensor_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_1_pad_0 = const()[name = tensor<string, []>("input_tensor_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_tensor_1_strides_0 = const()[name = tensor<string, []>("input_tensor_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_tensor_1_dilations_0 = const()[name = tensor<string, []>("input_tensor_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_1_groups_0 = const()[name = tensor<string, []>("input_tensor_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> input_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [128, 3, 3, 3]> Conv_0_weight_to_fp16 = const()[name = tensor<string, []>("Conv_0_weight_to_fp16"), val = tensor<fp16, [128, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [128]> Conv_0_bias_to_fp16 = const()[name = tensor<string, []>("Conv_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7040)))];
            tensor<fp16, [1, 3, 112, 112]> input_to_fp16 = cast(dtype = input_to_fp16_dtype_0, x = input__biased__)[name = tensor<string, []>("cast_36")];
            tensor<fp16, [1, 128, 56, 56]> input_tensor_1_cast_fp16 = conv(bias = Conv_0_bias_to_fp16, dilations = input_tensor_1_dilations_0, groups = input_tensor_1_groups_0, pad = input_tensor_1_pad_0, pad_type = input_tensor_1_pad_type_0, strides = input_tensor_1_strides_0, weight = Conv_0_weight_to_fp16, x = input_to_fp16)[name = tensor<string, []>("input_tensor_1_cast_fp16")];
            tensor<fp32, [128]> input_1_alpha_0 = const()[name = tensor<string, []>("input_1_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7360)))];
            tensor<fp16, [1, 128, 56, 56]> input_1_cast_fp16 = prelu(alpha = input_1_alpha_0, x = input_tensor_1_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<string, []> input_tensor_3_pad_type_0 = const()[name = tensor<string, []>("input_tensor_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_3_pad_0 = const()[name = tensor<string, []>("input_tensor_3_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_3_groups_0 = const()[name = tensor<string, []>("input_tensor_3_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> input_tensor_3_strides_0 = const()[name = tensor<string, []>("input_tensor_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_3_dilations_0 = const()[name = tensor<string, []>("input_tensor_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 2, 3, 3]> Conv_2_weight_to_fp16 = const()[name = tensor<string, []>("Conv_2_weight_to_fp16"), val = tensor<fp16, [128, 2, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7936)))];
            tensor<fp16, [128]> Conv_2_bias_to_fp16 = const()[name = tensor<string, []>("Conv_2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12608)))];
            tensor<fp16, [1, 128, 56, 56]> input_tensor_3_cast_fp16 = conv(bias = Conv_2_bias_to_fp16, dilations = input_tensor_3_dilations_0, groups = input_tensor_3_groups_0, pad = input_tensor_3_pad_0, pad_type = input_tensor_3_pad_type_0, strides = input_tensor_3_strides_0, weight = Conv_2_weight_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_tensor_3_cast_fp16")];
            tensor<fp32, [128]> input_3_alpha_0 = const()[name = tensor<string, []>("input_3_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12928)))];
            tensor<fp16, [1, 128, 56, 56]> input_3_cast_fp16 = prelu(alpha = input_3_alpha_0, x = input_tensor_3_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<string, []> input_tensor_5_pad_type_0 = const()[name = tensor<string, []>("input_tensor_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_5_strides_0 = const()[name = tensor<string, []>("input_tensor_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_5_pad_0 = const()[name = tensor<string, []>("input_tensor_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_5_dilations_0 = const()[name = tensor<string, []>("input_tensor_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_5_groups_0 = const()[name = tensor<string, []>("input_tensor_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_4_weight_to_fp16 = const()[name = tensor<string, []>("Conv_4_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13504)))];
            tensor<fp16, [128]> Conv_4_bias_to_fp16 = const()[name = tensor<string, []>("Conv_4_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46336)))];
            tensor<fp16, [1, 128, 56, 56]> input_tensor_5_cast_fp16 = conv(bias = Conv_4_bias_to_fp16, dilations = input_tensor_5_dilations_0, groups = input_tensor_5_groups_0, pad = input_tensor_5_pad_0, pad_type = input_tensor_5_pad_type_0, strides = input_tensor_5_strides_0, weight = Conv_4_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_tensor_5_cast_fp16")];
            tensor<fp32, [128]> input_5_alpha_0 = const()[name = tensor<string, []>("input_5_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46656)))];
            tensor<fp16, [1, 128, 56, 56]> input_5_cast_fp16 = prelu(alpha = input_5_alpha_0, x = input_tensor_5_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<string, []> input_tensor_7_pad_type_0 = const()[name = tensor<string, []>("input_tensor_7_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_7_pad_0 = const()[name = tensor<string, []>("input_tensor_7_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_tensor_7_strides_0 = const()[name = tensor<string, []>("input_tensor_7_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_tensor_7_groups_0 = const()[name = tensor<string, []>("input_tensor_7_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_tensor_7_dilations_0 = const()[name = tensor<string, []>("input_tensor_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> Conv_6_weight_to_fp16 = const()[name = tensor<string, []>("Conv_6_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(47232)))];
            tensor<fp16, [128]> Conv_6_bias_to_fp16 = const()[name = tensor<string, []>("Conv_6_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49600)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_7_cast_fp16 = conv(bias = Conv_6_bias_to_fp16, dilations = input_tensor_7_dilations_0, groups = input_tensor_7_groups_0, pad = input_tensor_7_pad_0, pad_type = input_tensor_7_pad_type_0, strides = input_tensor_7_strides_0, weight = Conv_6_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_tensor_7_cast_fp16")];
            tensor<fp32, [128]> input_7_alpha_0 = const()[name = tensor<string, []>("input_7_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49920)))];
            tensor<fp16, [1, 128, 28, 28]> input_7_cast_fp16 = prelu(alpha = input_7_alpha_0, x = input_tensor_7_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_9_strides_0 = const()[name = tensor<string, []>("input_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_9_dilations_0 = const()[name = tensor<string, []>("input_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_9_groups_0 = const()[name = tensor<string, []>("input_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_8_weight_to_fp16 = const()[name = tensor<string, []>("Conv_8_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(50496)))];
            tensor<fp16, [128]> Conv_8_bias_to_fp16 = const()[name = tensor<string, []>("Conv_8_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83328)))];
            tensor<fp16, [1, 128, 28, 28]> input_9_cast_fp16 = conv(bias = Conv_8_bias_to_fp16, dilations = input_9_dilations_0, groups = input_9_groups_0, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = input_9_strides_0, weight = Conv_8_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_tensor_9_pad_type_0 = const()[name = tensor<string, []>("input_tensor_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_9_strides_0 = const()[name = tensor<string, []>("input_tensor_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_9_pad_0 = const()[name = tensor<string, []>("input_tensor_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_9_dilations_0 = const()[name = tensor<string, []>("input_tensor_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_9_groups_0 = const()[name = tensor<string, []>("input_tensor_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_9_weight_to_fp16 = const()[name = tensor<string, []>("Conv_9_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(83648)))];
            tensor<fp16, [128]> Conv_9_bias_to_fp16 = const()[name = tensor<string, []>("Conv_9_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116480)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_9_cast_fp16 = conv(bias = Conv_9_bias_to_fp16, dilations = input_tensor_9_dilations_0, groups = input_tensor_9_groups_0, pad = input_tensor_9_pad_0, pad_type = input_tensor_9_pad_type_0, strides = input_tensor_9_strides_0, weight = Conv_9_weight_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("input_tensor_9_cast_fp16")];
            tensor<fp32, [128]> input_11_alpha_0 = const()[name = tensor<string, []>("input_11_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(116800)))];
            tensor<fp16, [1, 128, 28, 28]> input_11_cast_fp16 = prelu(alpha = input_11_alpha_0, x = input_tensor_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<string, []> input_tensor_11_pad_type_0 = const()[name = tensor<string, []>("input_tensor_11_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_11_pad_0 = const()[name = tensor<string, []>("input_tensor_11_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_11_groups_0 = const()[name = tensor<string, []>("input_tensor_11_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_tensor_11_strides_0 = const()[name = tensor<string, []>("input_tensor_11_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_11_dilations_0 = const()[name = tensor<string, []>("input_tensor_11_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> Conv_11_weight_to_fp16 = const()[name = tensor<string, []>("Conv_11_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(117376)))];
            tensor<fp16, [128]> Conv_11_bias_to_fp16 = const()[name = tensor<string, []>("Conv_11_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(119744)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_11_cast_fp16 = conv(bias = Conv_11_bias_to_fp16, dilations = input_tensor_11_dilations_0, groups = input_tensor_11_groups_0, pad = input_tensor_11_pad_0, pad_type = input_tensor_11_pad_type_0, strides = input_tensor_11_strides_0, weight = Conv_11_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_tensor_11_cast_fp16")];
            tensor<fp32, [128]> input_13_alpha_0 = const()[name = tensor<string, []>("input_13_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120064)))];
            tensor<fp16, [1, 128, 28, 28]> input_13_cast_fp16 = prelu(alpha = input_13_alpha_0, x = input_tensor_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<string, []> second_1_pad_type_0 = const()[name = tensor<string, []>("second_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> second_1_strides_0 = const()[name = tensor<string, []>("second_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> second_1_pad_0 = const()[name = tensor<string, []>("second_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> second_1_dilations_0 = const()[name = tensor<string, []>("second_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> second_1_groups_0 = const()[name = tensor<string, []>("second_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_13_weight_to_fp16 = const()[name = tensor<string, []>("Conv_13_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(120640)))];
            tensor<fp16, [128]> Conv_13_bias_to_fp16 = const()[name = tensor<string, []>("Conv_13_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153472)))];
            tensor<fp16, [1, 128, 28, 28]> second_1_cast_fp16 = conv(bias = Conv_13_bias_to_fp16, dilations = second_1_dilations_0, groups = second_1_groups_0, pad = second_1_pad_0, pad_type = second_1_pad_type_0, strides = second_1_strides_0, weight = Conv_13_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("second_1_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_15_cast_fp16 = add(x = input_9_cast_fp16, y = second_1_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<string, []> input_tensor_13_pad_type_0 = const()[name = tensor<string, []>("input_tensor_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_13_strides_0 = const()[name = tensor<string, []>("input_tensor_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_13_pad_0 = const()[name = tensor<string, []>("input_tensor_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_13_dilations_0 = const()[name = tensor<string, []>("input_tensor_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_13_groups_0 = const()[name = tensor<string, []>("input_tensor_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_15_weight_to_fp16 = const()[name = tensor<string, []>("Conv_15_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(153792)))];
            tensor<fp16, [128]> Conv_15_bias_to_fp16 = const()[name = tensor<string, []>("Conv_15_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(186624)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_13_cast_fp16 = conv(bias = Conv_15_bias_to_fp16, dilations = input_tensor_13_dilations_0, groups = input_tensor_13_groups_0, pad = input_tensor_13_pad_0, pad_type = input_tensor_13_pad_type_0, strides = input_tensor_13_strides_0, weight = Conv_15_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_tensor_13_cast_fp16")];
            tensor<fp32, [128]> input_17_alpha_0 = const()[name = tensor<string, []>("input_17_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(186944)))];
            tensor<fp16, [1, 128, 28, 28]> input_17_cast_fp16 = prelu(alpha = input_17_alpha_0, x = input_tensor_13_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<string, []> input_tensor_15_pad_type_0 = const()[name = tensor<string, []>("input_tensor_15_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_15_pad_0 = const()[name = tensor<string, []>("input_tensor_15_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_15_groups_0 = const()[name = tensor<string, []>("input_tensor_15_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_tensor_15_strides_0 = const()[name = tensor<string, []>("input_tensor_15_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_15_dilations_0 = const()[name = tensor<string, []>("input_tensor_15_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> Conv_17_weight_to_fp16 = const()[name = tensor<string, []>("Conv_17_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(187520)))];
            tensor<fp16, [128]> Conv_17_bias_to_fp16 = const()[name = tensor<string, []>("Conv_17_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(189888)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_15_cast_fp16 = conv(bias = Conv_17_bias_to_fp16, dilations = input_tensor_15_dilations_0, groups = input_tensor_15_groups_0, pad = input_tensor_15_pad_0, pad_type = input_tensor_15_pad_type_0, strides = input_tensor_15_strides_0, weight = Conv_17_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("input_tensor_15_cast_fp16")];
            tensor<fp32, [128]> input_19_alpha_0 = const()[name = tensor<string, []>("input_19_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(190208)))];
            tensor<fp16, [1, 128, 28, 28]> input_19_cast_fp16 = prelu(alpha = input_19_alpha_0, x = input_tensor_15_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<string, []> second_3_pad_type_0 = const()[name = tensor<string, []>("second_3_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> second_3_strides_0 = const()[name = tensor<string, []>("second_3_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> second_3_pad_0 = const()[name = tensor<string, []>("second_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> second_3_dilations_0 = const()[name = tensor<string, []>("second_3_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> second_3_groups_0 = const()[name = tensor<string, []>("second_3_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_19_weight_to_fp16 = const()[name = tensor<string, []>("Conv_19_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(190784)))];
            tensor<fp16, [128]> Conv_19_bias_to_fp16 = const()[name = tensor<string, []>("Conv_19_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(223616)))];
            tensor<fp16, [1, 128, 28, 28]> second_3_cast_fp16 = conv(bias = Conv_19_bias_to_fp16, dilations = second_3_dilations_0, groups = second_3_groups_0, pad = second_3_pad_0, pad_type = second_3_pad_type_0, strides = second_3_strides_0, weight = Conv_19_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("second_3_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_21_cast_fp16 = add(x = input_15_cast_fp16, y = second_3_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<string, []> input_tensor_17_pad_type_0 = const()[name = tensor<string, []>("input_tensor_17_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_17_strides_0 = const()[name = tensor<string, []>("input_tensor_17_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_17_pad_0 = const()[name = tensor<string, []>("input_tensor_17_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_17_dilations_0 = const()[name = tensor<string, []>("input_tensor_17_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_17_groups_0 = const()[name = tensor<string, []>("input_tensor_17_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_21_weight_to_fp16 = const()[name = tensor<string, []>("Conv_21_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(223936)))];
            tensor<fp16, [128]> Conv_21_bias_to_fp16 = const()[name = tensor<string, []>("Conv_21_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(256768)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_17_cast_fp16 = conv(bias = Conv_21_bias_to_fp16, dilations = input_tensor_17_dilations_0, groups = input_tensor_17_groups_0, pad = input_tensor_17_pad_0, pad_type = input_tensor_17_pad_type_0, strides = input_tensor_17_strides_0, weight = Conv_21_weight_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_tensor_17_cast_fp16")];
            tensor<fp32, [128]> input_23_alpha_0 = const()[name = tensor<string, []>("input_23_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(257088)))];
            tensor<fp16, [1, 128, 28, 28]> input_23_cast_fp16 = prelu(alpha = input_23_alpha_0, x = input_tensor_17_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<string, []> input_tensor_19_pad_type_0 = const()[name = tensor<string, []>("input_tensor_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_19_pad_0 = const()[name = tensor<string, []>("input_tensor_19_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_19_groups_0 = const()[name = tensor<string, []>("input_tensor_19_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_tensor_19_strides_0 = const()[name = tensor<string, []>("input_tensor_19_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_19_dilations_0 = const()[name = tensor<string, []>("input_tensor_19_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> Conv_23_weight_to_fp16 = const()[name = tensor<string, []>("Conv_23_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(257664)))];
            tensor<fp16, [128]> Conv_23_bias_to_fp16 = const()[name = tensor<string, []>("Conv_23_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(260032)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_19_cast_fp16 = conv(bias = Conv_23_bias_to_fp16, dilations = input_tensor_19_dilations_0, groups = input_tensor_19_groups_0, pad = input_tensor_19_pad_0, pad_type = input_tensor_19_pad_type_0, strides = input_tensor_19_strides_0, weight = Conv_23_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_tensor_19_cast_fp16")];
            tensor<fp32, [128]> input_25_alpha_0 = const()[name = tensor<string, []>("input_25_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(260352)))];
            tensor<fp16, [1, 128, 28, 28]> input_25_cast_fp16 = prelu(alpha = input_25_alpha_0, x = input_tensor_19_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> second_5_pad_type_0 = const()[name = tensor<string, []>("second_5_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> second_5_strides_0 = const()[name = tensor<string, []>("second_5_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> second_5_pad_0 = const()[name = tensor<string, []>("second_5_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> second_5_dilations_0 = const()[name = tensor<string, []>("second_5_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> second_5_groups_0 = const()[name = tensor<string, []>("second_5_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_25_weight_to_fp16 = const()[name = tensor<string, []>("Conv_25_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(260928)))];
            tensor<fp16, [128]> Conv_25_bias_to_fp16 = const()[name = tensor<string, []>("Conv_25_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(293760)))];
            tensor<fp16, [1, 128, 28, 28]> second_5_cast_fp16 = conv(bias = Conv_25_bias_to_fp16, dilations = second_5_dilations_0, groups = second_5_groups_0, pad = second_5_pad_0, pad_type = second_5_pad_type_0, strides = second_5_strides_0, weight = Conv_25_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("second_5_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_27_cast_fp16 = add(x = input_21_cast_fp16, y = second_5_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<string, []> input_tensor_21_pad_type_0 = const()[name = tensor<string, []>("input_tensor_21_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_21_strides_0 = const()[name = tensor<string, []>("input_tensor_21_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_21_pad_0 = const()[name = tensor<string, []>("input_tensor_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_21_dilations_0 = const()[name = tensor<string, []>("input_tensor_21_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_21_groups_0 = const()[name = tensor<string, []>("input_tensor_21_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_27_weight_to_fp16 = const()[name = tensor<string, []>("Conv_27_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(294080)))];
            tensor<fp16, [128]> Conv_27_bias_to_fp16 = const()[name = tensor<string, []>("Conv_27_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(326912)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_21_cast_fp16 = conv(bias = Conv_27_bias_to_fp16, dilations = input_tensor_21_dilations_0, groups = input_tensor_21_groups_0, pad = input_tensor_21_pad_0, pad_type = input_tensor_21_pad_type_0, strides = input_tensor_21_strides_0, weight = Conv_27_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_tensor_21_cast_fp16")];
            tensor<fp32, [128]> input_29_alpha_0 = const()[name = tensor<string, []>("input_29_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327232)))];
            tensor<fp16, [1, 128, 28, 28]> input_29_cast_fp16 = prelu(alpha = input_29_alpha_0, x = input_tensor_21_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<string, []> input_tensor_23_pad_type_0 = const()[name = tensor<string, []>("input_tensor_23_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_23_pad_0 = const()[name = tensor<string, []>("input_tensor_23_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_23_groups_0 = const()[name = tensor<string, []>("input_tensor_23_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> input_tensor_23_strides_0 = const()[name = tensor<string, []>("input_tensor_23_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_23_dilations_0 = const()[name = tensor<string, []>("input_tensor_23_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 1, 3, 3]> Conv_29_weight_to_fp16 = const()[name = tensor<string, []>("Conv_29_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(327808)))];
            tensor<fp16, [128]> Conv_29_bias_to_fp16 = const()[name = tensor<string, []>("Conv_29_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(330176)))];
            tensor<fp16, [1, 128, 28, 28]> input_tensor_23_cast_fp16 = conv(bias = Conv_29_bias_to_fp16, dilations = input_tensor_23_dilations_0, groups = input_tensor_23_groups_0, pad = input_tensor_23_pad_0, pad_type = input_tensor_23_pad_type_0, strides = input_tensor_23_strides_0, weight = Conv_29_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("input_tensor_23_cast_fp16")];
            tensor<fp32, [128]> input_31_alpha_0 = const()[name = tensor<string, []>("input_31_alpha_0"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(330496)))];
            tensor<fp16, [1, 128, 28, 28]> input_31_cast_fp16 = prelu(alpha = input_31_alpha_0, x = input_tensor_23_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<string, []> second_7_pad_type_0 = const()[name = tensor<string, []>("second_7_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> second_7_strides_0 = const()[name = tensor<string, []>("second_7_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> second_7_pad_0 = const()[name = tensor<string, []>("second_7_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> second_7_dilations_0 = const()[name = tensor<string, []>("second_7_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> second_7_groups_0 = const()[name = tensor<string, []>("second_7_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 1, 1]> Conv_31_weight_to_fp16 = const()[name = tensor<string, []>("Conv_31_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(331072)))];
            tensor<fp16, [128]> Conv_31_bias_to_fp16 = const()[name = tensor<string, []>("Conv_31_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(363904)))];
            tensor<fp16, [1, 128, 28, 28]> second_7_cast_fp16 = conv(bias = Conv_31_bias_to_fp16, dilations = second_7_dilations_0, groups = second_7_groups_0, pad = second_7_pad_0, pad_type = second_7_pad_type_0, strides = second_7_strides_0, weight = Conv_31_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("second_7_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> input_33_cast_fp16 = add(x = input_27_cast_fp16, y = second_7_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> input_tensor_25_pad_type_0 = const()[name = tensor<string, []>("input_tensor_25_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_25_strides_0 = const()[name = tensor<string, []>("input_tensor_25_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_25_pad_0 = const()[name = tensor<string, []>("input_tensor_25_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_25_dilations_0 = const()[name = tensor<string, []>("input_tensor_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_25_groups_0 = const()[name = tensor<string, []>("input_tensor_25_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 1, 1]> Conv_33_weight_to_fp16 = const()[name = tensor<string, []>("Conv_33_weight_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(364224)))];
            tensor<fp16, [256]> Conv_33_bias_to_fp16 = const()[name = tensor<string, []>("Conv_33_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(429824)))];
            tensor<fp16, [1, 256, 28, 28]> input_tensor_25_cast_fp16 = conv(bias = Conv_33_bias_to_fp16, dilations = input_tensor_25_dilations_0, groups = input_tensor_25_groups_0, pad = input_tensor_25_pad_0, pad_type = input_tensor_25_pad_type_0, strides = input_tensor_25_strides_0, weight = Conv_33_weight_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_tensor_25_cast_fp16")];
            tensor<fp32, [256]> input_35_alpha_0 = const()[name = tensor<string, []>("input_35_alpha_0"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(430400)))];
            tensor<fp16, [1, 256, 28, 28]> input_35_cast_fp16 = prelu(alpha = input_35_alpha_0, x = input_tensor_25_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<string, []> input_tensor_27_pad_type_0 = const()[name = tensor<string, []>("input_tensor_27_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_27_pad_0 = const()[name = tensor<string, []>("input_tensor_27_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_tensor_27_strides_0 = const()[name = tensor<string, []>("input_tensor_27_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> input_tensor_27_groups_0 = const()[name = tensor<string, []>("input_tensor_27_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [2]> input_tensor_27_dilations_0 = const()[name = tensor<string, []>("input_tensor_27_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> Conv_35_weight_to_fp16 = const()[name = tensor<string, []>("Conv_35_weight_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(431488)))];
            tensor<fp16, [256]> Conv_35_bias_to_fp16 = const()[name = tensor<string, []>("Conv_35_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(436160)))];
            tensor<fp16, [1, 256, 14, 14]> input_tensor_27_cast_fp16 = conv(bias = Conv_35_bias_to_fp16, dilations = input_tensor_27_dilations_0, groups = input_tensor_27_groups_0, pad = input_tensor_27_pad_0, pad_type = input_tensor_27_pad_type_0, strides = input_tensor_27_strides_0, weight = Conv_35_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_tensor_27_cast_fp16")];
            tensor<fp32, [256]> input_37_alpha_0 = const()[name = tensor<string, []>("input_37_alpha_0"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(436736)))];
            tensor<fp16, [1, 256, 14, 14]> input_37_cast_fp16 = prelu(alpha = input_37_alpha_0, x = input_tensor_27_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> input_39_pad_type_0 = const()[name = tensor<string, []>("input_39_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_39_strides_0 = const()[name = tensor<string, []>("input_39_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_39_pad_0 = const()[name = tensor<string, []>("input_39_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_39_dilations_0 = const()[name = tensor<string, []>("input_39_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_39_groups_0 = const()[name = tensor<string, []>("input_39_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> Conv_37_weight_to_fp16 = const()[name = tensor<string, []>("Conv_37_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(437824)))];
            tensor<fp16, [256]> Conv_37_bias_to_fp16 = const()[name = tensor<string, []>("Conv_37_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(568960)))];
            tensor<fp16, [1, 256, 14, 14]> input_39_cast_fp16 = conv(bias = Conv_37_bias_to_fp16, dilations = input_39_dilations_0, groups = input_39_groups_0, pad = input_39_pad_0, pad_type = input_39_pad_type_0, strides = input_39_strides_0, weight = Conv_37_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<string, []> input_tensor_29_pad_type_0 = const()[name = tensor<string, []>("input_tensor_29_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_29_strides_0 = const()[name = tensor<string, []>("input_tensor_29_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_29_pad_0 = const()[name = tensor<string, []>("input_tensor_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_29_dilations_0 = const()[name = tensor<string, []>("input_tensor_29_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_29_groups_0 = const()[name = tensor<string, []>("input_tensor_29_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> Conv_38_weight_to_fp16 = const()[name = tensor<string, []>("Conv_38_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(569536)))];
            tensor<fp16, [256]> Conv_38_bias_to_fp16 = const()[name = tensor<string, []>("Conv_38_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(700672)))];
            tensor<fp16, [1, 256, 14, 14]> input_tensor_29_cast_fp16 = conv(bias = Conv_38_bias_to_fp16, dilations = input_tensor_29_dilations_0, groups = input_tensor_29_groups_0, pad = input_tensor_29_pad_0, pad_type = input_tensor_29_pad_type_0, strides = input_tensor_29_strides_0, weight = Conv_38_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_tensor_29_cast_fp16")];
            tensor<fp32, [256]> input_41_alpha_0 = const()[name = tensor<string, []>("input_41_alpha_0"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(701248)))];
            tensor<fp16, [1, 256, 14, 14]> input_41_cast_fp16 = prelu(alpha = input_41_alpha_0, x = input_tensor_29_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> input_tensor_31_pad_type_0 = const()[name = tensor<string, []>("input_tensor_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_31_pad_0 = const()[name = tensor<string, []>("input_tensor_31_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_31_groups_0 = const()[name = tensor<string, []>("input_tensor_31_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [2]> input_tensor_31_strides_0 = const()[name = tensor<string, []>("input_tensor_31_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_tensor_31_dilations_0 = const()[name = tensor<string, []>("input_tensor_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [256, 1, 3, 3]> Conv_40_weight_to_fp16 = const()[name = tensor<string, []>("Conv_40_weight_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(702336)))];
            tensor<fp16, [256]> Conv_40_bias_to_fp16 = const()[name = tensor<string, []>("Conv_40_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(707008)))];
            tensor<fp16, [1, 256, 14, 14]> input_tensor_31_cast_fp16 = conv(bias = Conv_40_bias_to_fp16, dilations = input_tensor_31_dilations_0, groups = input_tensor_31_groups_0, pad = input_tensor_31_pad_0, pad_type = input_tensor_31_pad_type_0, strides = input_tensor_31_strides_0, weight = Conv_40_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_tensor_31_cast_fp16")];
            tensor<fp32, [256]> input_43_alpha_0 = const()[name = tensor<string, []>("input_43_alpha_0"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(707584)))];
            tensor<fp16, [1, 256, 14, 14]> input_43_cast_fp16 = prelu(alpha = input_43_alpha_0, x = input_tensor_31_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<string, []> second_9_pad_type_0 = const()[name = tensor<string, []>("second_9_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> second_9_strides_0 = const()[name = tensor<string, []>("second_9_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> second_9_pad_0 = const()[name = tensor<string, []>("second_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> second_9_dilations_0 = const()[name = tensor<string, []>("second_9_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> second_9_groups_0 = const()[name = tensor<string, []>("second_9_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> Conv_42_weight_to_fp16 = const()[name = tensor<string, []>("Conv_42_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(708672)))];
            tensor<fp16, [256]> Conv_42_bias_to_fp16 = const()[name = tensor<string, []>("Conv_42_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(839808)))];
            tensor<fp16, [1, 256, 14, 14]> second_9_cast_fp16 = conv(bias = Conv_42_bias_to_fp16, dilations = second_9_dilations_0, groups = second_9_groups_0, pad = second_9_pad_0, pad_type = second_9_pad_type_0, strides = second_9_strides_0, weight = Conv_42_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("second_9_cast_fp16")];
            tensor<fp16, [1, 256, 14, 14]> input_45_cast_fp16 = add(x = input_39_cast_fp16, y = second_9_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<string, []> input_tensor_33_pad_type_0 = const()[name = tensor<string, []>("input_tensor_33_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_tensor_33_strides_0 = const()[name = tensor<string, []>("input_tensor_33_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_tensor_33_pad_0 = const()[name = tensor<string, []>("input_tensor_33_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_tensor_33_dilations_0 = const()[name = tensor<string, []>("input_tensor_33_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_tensor_33_groups_0 = const()[name = tensor<string, []>("input_tensor_33_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 256, 1, 1]> Conv_44_weight_to_fp16 = const()[name = tensor<string, []>("Conv_44_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(840384)))];
            tensor<fp16, [256]> Conv_44_bias_to_fp16 = const()[name = tensor<string, []>("Conv_44_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(971520)))];
            tensor<fp16, [1, 256, 14, 14]> input_tensor_33_cast_fp16 = conv(bias = Conv_44_bias_to_fp16, dilations = input_tensor_33_dilations_0, groups = input_tensor_33_groups_0, pad = input_tensor_33_pad_0, pad_type = input_tensor_33_pad_type_0, strides = input_tensor_33_strides_0, weight = Conv_44_weight_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("input_tensor_33_cast_fp16")];
            tensor<fp32, [256]> input_47_alpha_0 = const()[name = tensor<string, []>("input_47_alpha_0"), val = tensor<fp32, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(972096)))];
            tensor<fp16, [1, 256, 14, 14]> input_47_cast_fp16 = prelu(alpha = input_47_alpha_0, x = input_tensor_33_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<string, []> input_tensor_35_pad_type_0 = const()[name = tensor<string, []>("input_tensor_35_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_tensor_35_pad_0 = const()[name = tensor<string, []>("input_tensor_35_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_tensor_35_groups_0 = const()[name = tensor<string, []>("input_tensor_35_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [2]> input_tensor_35_strides_0 = const()[name = tensor<string, []>("input_tensor_35_strides_0"), val = tensor<int32, [2]>([1, 1])];
